In [1]:
import pandas as pd

## 合并

### merge方法一对一数据合并

In [2]:
# 相同的列进行合并
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, on='编号')
new_df

        编号   语文   数学   英语    体育
0  msb1001  145  150  134  35.4
1  msb1002  146  145  143  23.5

In [3]:
# 通过索引列进行合并数据
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, left_index=True, right_index=True)
new_df

      编号_x   语文   数学   英语     编号_y    体育
0  msb1001  145  150  134  msb1001  35.4
1  msb1002  146  145  143  msb1002  23.5
2  msb1003  150  134  135  msb1004  45.5

In [4]:
# 数据合并之后，去掉重复数据
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, how='left', on ='编号')
new_df

        编号   语文   数学   英语    体育
0  msb1001  145  150  134  35.4
1  msb1002  146  145  143  23.5
2  msb1003  150  134  135   NaN

In [5]:
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, how='right', on ='编号')
new_df

        编号     语文     数学     英语    体育
0  msb1001  145.0  150.0  134.0  35.4
1  msb1002  146.0  145.0  143.0  23.5
2  msb1004    NaN    NaN    NaN  45.5

In [6]:
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, how='inner', on ='编号')
new_df

        编号   语文   数学   英语    体育
0  msb1001  145  150  134  35.4
1  msb1002  146  145  143  23.5

In [7]:
import pandas as pd 
df1 = pd.read_excel('data/student1.xlsx')
df2 = pd.read_excel('data/student2.xlsx')

new_df = pd.merge(df1, df2, how='outer', on ='编号')
new_df

        编号     语文     数学     英语    体育
0  msb1001  145.0  150.0  134.0  35.4
1  msb1002  146.0  145.0  143.0  23.5
2  msb1003  150.0  134.0  135.0   NaN
3  msb1004    NaN    NaN    NaN  45.5

### merge方法多对一数据合并

In [8]:
import pandas as pd

df1 = pd.DataFrame({
    'ID': ['1001', '1002', '1003'],
    'name': ['七七', '琴团长', '提纳里'],
})

df2 = pd.DataFrame({
    'ID': ['1001', '1001', '1003'],
    '国家': ['璃月', '蒙德', '须弥'],
    '元素力': ['冰', '风', '草'],
    '武器' :['祭礼剑', '天目影打刀','猎人之径']
})

# 多对一的数据合并
new_df = pd.merge(df1, df2, on='ID')
print(new_df)

     ID name  国家 元素力     武器
0  1001   七七  璃月   冰    祭礼剑
1  1001   七七  蒙德   风  天目影打刀
2  1003  提纳里  须弥   草   猎人之径

### merge方法多对多数据合并

In [9]:
import pandas as pd 

df1 = pd.DataFrame({
    'ID': [1001,1002,1003,1003,1003],
    'English':[145, 134, 143, 145, 147]
    })

df2 = pd.DataFrame({
    'ID': [1001,1002,1003,1001,1001],
    'Math':[34.5, 28.4, 39.6, 34.6, 45.5]
    })

new_df = pd.merge(df1, df2)
new_df

     ID  English  Math
0  1001      145  34.5
1  1001      145  34.6
2  1001      145  45.5
3  1002      134  28.4
4  1003      143  39.6
5  1003      145  39.6
6  1003      147  39.6

### concat方法纵向合并

In [10]:
import pandas as pd

df1 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet1')
df2 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet2')
df3 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet3')

# 合并
new_df1 = pd.concat([df1, df2, df3], keys=['表1', '表2', '表3'])
new_df2 = pd.concat([df1, df2, df3], keys=['表1', '表2', '表3'], ignore_index=True)
# ignore_index=True 忽略忽略原始索引， 重新生成索引
print(new_df1)
print(new_df2)

        A    B    C    D
表1 0   11   22   33   44
   1   12   23   34   45
表2 0   99   88   77   66
   1   55   44   33   22
   2   11   23  345   35
表3 0  333  222  444  555
     A    B    C    D
0   11   22   33   44
1   12   23   34   45
2   99   88   77   66
3   55   44   33   22
4   11   23  345   35
5  333  222  444  555

###  concat方法横向合并-交叉合并

In [11]:
# concact 横向表连接方式
import pandas as pd

df1 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet1')
df2 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet4')

# 合并
df = pd.concat([df1, df2], axis=1)
df

      A     B     C     D       D       E        F
0  11.0  22.0  33.0  44.0      44  world1  python1
1  12.0  23.0  34.0  45.0      45  world2  python2
2   NaN   NaN   NaN   NaN  hello3  world3  python3
3   NaN   NaN   NaN   NaN  hello4  world4  python4
4   NaN   NaN   NaN   NaN  hello5  world5  python5

In [12]:
# concact   inner 内连接: 内连接是指只保留两个数据集共有的行或列，而丢弃其他不共有的部分
#           outer 外连接是指保留两个数据集中所有的行或列，其中一个数据集中没有的部分用 NaN 或缺失值填充。
import pandas as pd

df1 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet1')
df2 = pd.read_excel('data/数据合并concat.xlsx', sheet_name='Sheet4')

# 合并
df = pd.concat([df1, df2], axis=1, join='inner')
df

    A   B   C   D   D       E        F
0  11  22  33  44  44  world1  python1
1  12  23  34  45  45  world2  python2

## 导出

### 数据导出到Excel文件

In [13]:
import pandas as pd

df=pd.DataFrame({
    'ID':['Ice-1', 'Ice-2', 'Fire-1', 'Fire-2', 'Thunder-1', 'Thunder-2', 'Rock-1', 'Rock-2'],
    'Name':['莱欧斯利','甘雨','可莉','迪卢克','八重神子','雷电将军','娜维娅','钟离'],
    'Location':['枫丹', '璃月', '蒙德', '蒙德','稻妻', '稻妻', '枫丹','璃月']
})

df.to_excel('data/数据导出-提瓦特.xlsx', index=False, sheet_name='提瓦特角色')
# index=False:不输出索引

###  数据导出到多sheet表

In [14]:
import pandas as pd

df=pd.DataFrame({
    'ID':['Ice-1', 'Ice-2', 'Fire-1', 'Fire-2', 'Thunder-1', 'Thunder-2', 'Rock-1', 'Rock-2'],
    'Name':['莱欧斯利','甘雨','可莉','迪卢克','八重神子','雷电将军','娜维娅','钟离'],
    'Location':['枫丹', '璃月', '蒙德', '蒙德','稻妻', '稻妻', '枫丹','璃月'],
    'Weapon':['金流监督', '阿莫斯职弓', '四风原典','狼的末路', '神乐舞', '薙草之稻光', '尘世之锁', '贯虹之槊']
})

with pd.ExcelWriter('data/数据导出-提瓦特-多sheet.xlsx') as work:
    df.to_excel(work, sheet_name='提瓦特总', index=False)  # 将 DataFrame 导出到 名称为 "提瓦特总" 的页
    df[['Name', 'Weapon']].to_excel(work, sheet_name='武器', index=False)  # 将 DataFrame 导出到 名称为 "武器" 的页

### 数据导出到CSV文件

In [15]:
import pandas as pd

df=pd.DataFrame({
    'ID':['Ice-1', 'Ice-2', 'Fire-1', 'Fire-2', 'Thunder-1', 'Thunder-2', 'Rock-1', 'Rock-2'],
    'Name':['莱欧斯利','甘雨','可莉','迪卢克','八重神子','雷电将军','娜维娅','钟离'],
    'Location':['枫丹', '璃月', '蒙德', '蒙德','稻妻', '稻妻', '枫丹','璃月'],
    'Weapon':['金流监督', '阿莫斯职弓', '四风原典','狼的末路', '神乐舞', '薙草之稻光', '尘世之锁', '贯虹之槊'],
    'Score':[77.83, 79.65, 80, 82, 75.69, 72.63, 74.56, 85.23]
})
df.to_csv('Data/提瓦特.csv', index=False, columns=['ID', 'Name', 'Location', 'Weapon', 'Score'], float_format='%.1f')